apache/nuttx/arch/arm/src/common/stm32/stm32_dac_m3m4_v1.c
/****************************************************************************
 * arch/arm/src/common/stm32/stm32_dac_m3m4_v1.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <stdio.h>
#include <sys/types.h>
#include <stdint.h>
#include <stdbool.h>
#include <string.h>
#include <errno.h>
#include <nuttx/debug.h>

#include <arch/board/board.h>
#include <nuttx/irq.h>
#include <nuttx/analog/dac.h>

#include "arm_internal.h"
#include "chip.h"
#include "stm32.h"
#include "stm32_dac_m3m4_v1.h"
#include "stm32_rcc.h"
#include "stm32_dma.h"
#include "stm32_syscfg.h"

#ifdef CONFIG_DAC

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* RCC reset ****************************************************************/

#if defined(HAVE_IP_DAC_V1)
#  define STM32_RCC_RSTR     STM32_RCC_APB1RSTR
#  define RCC_RSTR_DAC1RST   RCC_APB1RSTR_DAC1RST
#  define RCC_RSTR_DAC2RST   RCC_APB1RSTR_DAC2RST
#elif defined(HAVE_IP_DAC_V2)
#  define STM32_RCC_RSTR     STM32_RCC_AHB2RSTR
#  define RCC_RSTR_DAC1RST   RCC_AHB2RSTR_DAC1RST
#  define RCC_RSTR_DAC2RST   RCC_AHB2RSTR_DAC2RST
#  define RCC_RSTR_DAC3RST   RCC_AHB2RSTR_DAC3RST
#  define RCC_RSTR_DAC4RST   RCC_AHB2RSTR_DAC4RST
#endif

/* Configuration ************************************************************/

/* Up to 2 DAC interfaces for up to 3 channels are supported
 *
 * NOTE: STM32_NDAC tells how many channels chip supports.
 *       ST is not consistent in the naming of DAC interfaces, so we
 *       introduce our own naming convention. We distinguish DAC1 and DAC2
 *       only if the chip has two separate areas in memory map to support DAC
 *       channels.
 */

#if STM32_NDAC < 3
#  warning
#  undef CONFIG_STM32_DAC2CH1
#  undef CONFIG_STM32_DAC2CH1_DMA
#  undef CONFIG_STM32_DAC2CH1_TIMER
#  undef CONFIG_STM32_DAC2CH1_TIMER_FREQUENCY
#endif

#if STM32_NDAC < 2
#  warning
#  undef CONFIG_STM32_DAC1CH2
#  undef CONFIG_STM32_DAC1CH2_DMA
#  undef CONFIG_STM32_DAC1CH2_TIMER
#  undef CONFIG_STM32_DAC1CH2_TIMER_FREQUENCY
#endif

#if STM32_NDAC < 1
#  warning
#  undef CONFIG_STM32_DAC1CH1
#  undef CONFIG_STM32_DAC1CH1_DMA
#  undef CONFIG_STM32_DAC1CH1_TIMER
#  undef CONFIG_STM32_DAC1CH1_TIMER_FREQUENCY
#endif

/* Sanity checking */

#ifdef CONFIG_STM32_DAC1
#  if !defined(CONFIG_STM32_DAC1CH1) && !defined(CONFIG_STM32_DAC1CH2)
#    error "DAC1 enabled but no channel was selected"
#  endif
#endif

#ifdef CONFIG_STM32_DAC2
#  if !defined(CONFIG_STM32_DAC2CH1)
#    error "DAC2 enabled but no channel was selected"
#  endif
#endif

#ifdef CONFIG_STM32_DAC3
#  if !defined(CONFIG_STM32_DAC3CH1) && !defined(CONFIG_STM32_DAC3CH2)
#    error "DAC3 enabled but no channel was selected"
#  endif
#endif

#ifdef CONFIG_STM32_DAC4
#  if !defined(CONFIG_STM32_DAC4CH1) && !defined(CONFIG_STM32_DAC4CH2)
#    error "DAC4 enabled but no channel was selected"
#  endif
#endif

/* DMA configuration. */

#if defined(CONFIG_STM32_DAC1CH1_DMA) || defined(CONFIG_STM32_DAC1CH2_DMA) || \
    defined(CONFIG_STM32_DAC2CH1_DMA)
#  if defined(CONFIG_STM32_STM32F10XX) || defined(CONFIG_STM32_STM32F30XX)
#    ifndef CONFIG_STM32_DMA2
#      warning "STM32 F1/F3 DAC DMA support requires CONFIG_STM32_DMA2"
#      undef CONFIG_STM32_DAC1CH1_DMA
#      undef CONFIG_STM32_DAC1CH2_DMA
#      undef CONFIG_STM32_DAC2CH1_DMA
#    endif
#  elif defined(CONFIG_STM32_STM32F33XX)
#    ifndef CONFIG_STM32_DMA1
#      warning "STM32 F334 DAC DMA support requires CONFIG_STM32_DMA1"
#      undef CONFIG_STM32_DAC1CH1_DMA
#      undef CONFIG_STM32_DAC1CH2_DMA
#      undef CONFIG_STM32_DAC2CH1_DMA
#    endif
#  elif defined(CONFIG_STM32_HAVE_IP_DAC_M3M4_V1)
#    ifndef CONFIG_STM32_DMA1
#      warning "STM32 F4 DAC DMA support requires CONFIG_STM32_DMA1"
#      undef CONFIG_STM32_DAC1CH1_DMA
#      undef CONFIG_STM32_DAC1CH2_DMA
#      undef CONFIG_STM32_DAC2CH1_DMA
#    endif
#  else
#    warning "No DAC DMA information for this STM32 family"
#    undef CONFIG_STM32_DAC1CH1_DMA
#    undef CONFIG_STM32_DAC1CH2_DMA
#    undef CONFIG_STM32_DAC2CH1_DMA
#  endif
#endif

#if defined(CONFIG_STM32_DAC1CH1_HRTIM_TRG1) || defined(CONFIG_STM32_DAC1CH1_HRTIM_TRG2)
#  define DAC1CH1_HRTIM
#endif
#if defined(CONFIG_STM32_DAC1CH2_HRTIM_TRG1) || defined(CONFIG_STM32_DAC1CH2_HRTIM_TRG2)
#  define DAC1CH2_HRTIM
#endif
#if defined(CONFIG_STM32_DAC2CH1_HRTIM_TRG3)
#  define DAC2CH1_HRTIM
#endif

/* If DMA is selected, then a timer and output frequency must also be
 * provided to support the DMA transfer.  The DMA transfer could be
 * supported by and EXTI trigger, but this feature is not currently
 * supported by the driver.
 */

#if defined(CONFIG_STM32_DAC1CH1_DMA) && !defined(DAC1CH1_HRTIM) && \
    !defined(CONFIG_STM32_DAC1CH1_DMA_EXTERNAL)
#  if !defined(CONFIG_STM32_DAC1CH1_TIMER)
#    warning "A timer number must be specified in CONFIG_STM32_DAC1CH1_TIMER"
#    undef CONFIG_STM32_DAC1CH1_DMA
#    undef CONFIG_STM32_DAC1CH1_TIMER_FREQUENCY
#  elif !defined(CONFIG_STM32_DAC1CH1_TIMER_FREQUENCY)
#    warning "A timer frequency must be specified in CONFIG_STM32_DAC1CH1_TIMER_FREQUENCY"
#    undef CONFIG_STM32_DAC1CH1_DMA
#    undef CONFIG_STM32_DAC1CH1_TIMER
#  endif
#endif

#if defined(CONFIG_STM32_DAC1CH2_DMA) && !defined(DAC1CH2_HRTIM) && \
    !defined(CONFIG_STM32_DAC1CH2_DMA_EXTERNAL)
#  if !defined(CONFIG_STM32_DAC1CH2_TIMER)
#    warning "A timer number must be specified in CONFIG_STM32_DAC1CH2_TIMER"
#    undef CONFIG_STM32_DAC1CH2_DMA
#    undef CONFIG_STM32_DAC1CH2_TIMER_FREQUENCY
#  elif !defined(CONFIG_STM32_DAC1CH2_TIMER_FREQUENCY)
#    warning "A timer frequency must be specified in CONFIG_STM32_DAC1CH2_TIMER_FREQUENCY"
#    undef CONFIG_STM32_DAC1CH2_DMA
#    undef CONFIG_STM32_DAC1CH2_TIMER
#  endif
#endif

