apache/nuttx/arch/arm/src/common/stm32/stm32_dac_m3m4_v1.c
#if defined(CONFIG_STM32_DAC2CH1_DMA) && !defined(DAC2CH1_HRTIM) && \
    !defined(CONFIG_STM32_DAC2CH1_DMA_EXTERNAL)
#  if !defined(CONFIG_STM32_DAC2CH1_TIMER)
#    warning "A timer number must be specified in CONFIG_STM32_DAC2CH1_TIMER"
#    undef CONFIG_STM32_DAC2CH1_DMA
#    undef CONFIG_STM32_DAC2CH1_TIMER_FREQUENCY
#  elif !defined(CONFIG_STM32_DAC2CH1_TIMER_FREQUENCY)
#    warning "A timer frequency must be specified in CONFIG_STM32_DAC2CH1_TIMER_FREQUENCY"
#    undef CONFIG_STM32_DAC2CH1_DMA
#    undef CONFIG_STM32_DAC2CH1_TIMER
#  endif
#endif

/* DMA **********************************************************************/

/* DMA channels and interface values differ for the F1 and F4 families */

#undef HAVE_DMA
#if defined(CONFIG_STM32_DAC1CH1_DMA) || defined(CONFIG_STM32_DAC1CH2_DMA) || \
    defined(CONFIG_STM32_DAC2CH1_DMA)
#  if defined(CONFIG_STM32_STM32F10XX) || defined(CONFIG_STM32_STM32F30XX) || \
      defined(CONFIG_STM32_STM32F33XX)
#    define HAVE_DMA        1
#    define DAC_DMA         2
#  if defined(CONFIG_STM32_DAC1CH1) && !defined(CONFIG_STM32_DAC1CH1_DMA_EXTERNAL)
#    define DAC1CH1_DMA_CHAN   DMACHAN_DAC1_CH1
#  endif
#  if defined(CONFIG_STM32_DAC1CH2) && !defined(CONFIG_STM32_DAC1CH2_DMA_EXTERNAL)
#    define DAC1CH2_DMA_CHAN   DMACHAN_DAC1_CH2
#  endif
#  if defined(CONFIG_STM32_DAC2CH1) && !defined(CONFIG_STM32_DAC2CH1_DMA_EXTERNAL)
#    define DAC2CH1_DMA_CHAN   DMACHAN_DAC2_CH1
#  endif
#  elif defined(CONFIG_STM32_HAVE_IP_DAC_M3M4_V1)
#    define HAVE_DMA        1
#    define DAC_DMA         1
#    if defined(CONFIG_STM32_DAC1CH1) && !defined(CONFIG_STM32_DAC1CH1_DMA_EXTERNAL)
#      define DAC1CH1_DMA_CHAN   DMAMAP_DAC1
#    endif
#    if defined(CONFIG_STM32_DAC1CH2) && !defined(CONFIG_STM32_DAC1CH2_DMA_EXTERNAL)
#      define DAC1CH2_DMA_CHAN   DMAMAP_DAC1
#    endif
#    if defined(CONFIG_STM32_DAC2CH1) && !defined(CONFIG_STM32_DAC2CH1_DMA_EXTERNAL)
#      define DAC2CH1_DMA_CHAN   DMAMAP_DAC2
#    endif
#  endif
#endif

/* Timer configuration.  The STM32 supports 8 different trigger for DAC
 * output:
 *
 * TSEL SOURCE                  DEVICES
 * ---- ----------------------- -------------------------------------
 * 000  Timer 6 TRGO event      ALL
 * 001  Timer 3 TRGO event      STM32 F1 Connectivity Line and STM32 F3
 *      Timer 8 TRGO event      Other STM32 F1 and all STM32 F4
 * 010  Timer 7 TRGO event      ALL
 * 011  Timer 5 TRGO event      ALL
 *      Timer 15 TRGO event     STM32 F3
 *      HRTIM1_DACTRG1 event    STM32F33XX (DAC1 only)
 * 100  Timer 2 TRGO event      ALL
 * 101  Timer 4 TRGO event      ALL
 *      HRTIM1_DACTRG2 event    STM32F33XX (DAC1 only)
 *      HRTIM1_DACTRG3 event    STM32F33XX (DAC2 only)
 * 110  EXTI line9              ALL
 * 111  SWTRIG Software control ALL
 *
 * This driver does not support the EXTI trigger.
 */

/* DMA transfer from DMA buffer to DAC register can also be triggered by an
 * external to the DAC block events. In this case, the DAC trigger (TEN bit)
 * must be reset and board configuration must provide DACxCHy_DMA_CHAN.
 */

#undef NEED_TIM6
#undef NEED_TIM3
#undef NEED_TIM8
#undef NEED_TIM7
#undef NEED_TIM5
#undef NEED_TIM2
#undef NEED_TIM4

#ifdef CONFIG_STM32_DAC1CH1_DMA
#  if defined(CONFIG_STM32_DAC1CH1_DMA_EXTERNAL)
#  elif defined(CONFIG_STM32_DAC1CH1_HRTIM_TRG1)
#    ifndef CONFIG_STM32_HRTIM_DAC
#      error  "CONFIG_STM32_HRTIM_DAC required for DAC1CH1"
#    endif
#    define DAC1CH1_TSEL_VALUE           DAC_CR_TSEL_HRT1TRG1
#  elif defined(CONFIG_STM32_DAC1CH1_HRTIM_TRG2)
#    ifndef CONFIG_STM32_HRTIM_DAC
#      error  "CONFIG_STM32_HRTIM_DAC required for DAC1CH2"
#    endif
#    define DAC1CH1_TSEL_VALUE           DAC_CR_TSEL_HRT1TRG2
#  elif CONFIG_STM32_DAC1CH1_TIMER == 6
#    ifndef CONFIG_STM32_TIM6_DAC
#      error "CONFIG_STM32_TIM6_DAC required for DAC1CH1"
#    endif
#    define NEED_TIM6
#    define DAC1CH1_TSEL_VALUE           DAC_CR_TSEL_TIM6
#    define DAC1CH1_TIMER_BASE           STM32_TIM6_BASE
#    define DAC1CH1_TIMER_PCLK_FREQUENCY STM32_PCLK1_FREQUENCY
#  elif CONFIG_STM32_DAC1CH1_TIMER == 3 && defined(CONFIG_STM32_CONNECTIVITYLINE)
#    ifndef CONFIG_STM32_TIM3_DAC
#      error "CONFIG_STM32_TIM3_DAC required for DAC1CH1"
#    endif
#    define NEED_TIM3
#    define DAC1CH1_TSEL_VALUE           DAC_CR_TSEL_TIM3
#    define DAC1CH1_TIMER_BASE           STM32_TIM3_BASE
#    define DAC1CH1_TIMER_PCLK_FREQUENCY STM32_PCLK1_FREQUENCY
#  elif CONFIG_STM32_DAC1CH1_TIMER == 8 && !defined(CONFIG_STM32_CONNECTIVITYLINE)
#    ifndef CONFIG_STM32_TIM8_DAC
#      error "CONFIG_STM32_TIM8_DAC required for DAC1CH1"
#    endif
#    define NEED_TIM8
#    define DAC1CH1_TSEL_VALUE           DAC_CR_TSEL_TIM8
#    define DAC1CH1_TIMER_BASE           STM32_TIM8_BASE
#    define DAC1CH1_TIMER_PCLK_FREQUENCY STM32_PCLK2_FREQUENCY
#  elif CONFIG_STM32_DAC1CH1_TIMER == 7
#    ifndef CONFIG_STM32_TIM7_DAC
#      error "CONFIG_STM32_TIM7_DAC required for DAC1CH1"
#    endif
#    define NEED_TIM7
#    define DAC1CH1_TSEL_VALUE DAC_CR_TSEL_TIM7
#    define DAC1CH1_TIMER_BASE STM32_TIM7_BASE
#  elif CONFIG_STM32_DAC1CH1_TIMER == 5
#    ifndef CONFIG_STM32_TIM5_DAC
#      error "CONFIG_STM32_TIM5_DAC required for DAC1CH1"
#    endif
#    define NEED_TIM5
#    define DAC1CH1_TSEL_VALUE           DAC_CR_TSEL_TIM5
#    define DAC1CH1_TIMER_BASE           STM32_TIM5_BASE
#    define DAC1CH1_TIMER_PCLK_FREQUENCY STM32_PCLK1_FREQUENCY
#  elif CONFIG_STM32_DAC1CH1_TIMER == 2
#    ifndef CONFIG_STM32_TIM2_DAC
#      error "CONFIG_STM32_TIM2_DAC required for DAC1CH1"
#    endif
#    define NEED_TIM2
#    define DAC1CH1_TSEL_VALUE           DAC_CR_TSEL_TIM2
#    define DAC1CH1_TIMER_BASE           STM32_TIM2_BASE
#    define DAC1CH1_TIMER_PCLK_FREQUENCY STM32_PCLK1_FREQUENCY
#  elif CONFIG_STM32_DAC1CH1_TIMER == 4
#    ifndef CONFIG_STM32_TIM4_DAC
#      error "CONFIG_STM32_TIM4_DAC required for DAC1CH1"
#    endif
#    define NEED_TIM4
#    define DAC1CH1_TSEL_VALUE           DAC_CR_TSEL_TIM4
#    define DAC1CH1_TIMER_BASE           STM32_TIM4_BASE
#    define DAC1CH1_TIMER_PCLK_FREQUENCY STM32_PCLK1_FREQUENCY
#  else
#    error "Unsupported CONFIG_STM32_DAC1CH1_TIMER"
#  endif
#else
#  define DAC1CH1_TSEL_VALUE DAC_CR_TSEL_SW
#endif

#if defined(NEED_TIM2) || defined(NEED_TIM3) || defined(NEED_TIM4) || \
    defined(NEED_TIM5) || defined(NEED_TIM6) || defined(NEED_TIM7) || \
    defined(NEED_TIM8)
#  define HAVE_TIMER
#endif

#ifdef CONFIG_STM32_DAC1CH2_DMA
#  if defined(CONFIG_STM32_DAC1CH2_DMA_EXTERNAL)
#  elif defined(CONFIG_STM32_DAC1CH2_HRTIM_TRG1)
#    ifndef CONFIG_STM32_HRTIM_DAC
#      error  "CONFIG_STM32_HRTIM_DAC required for DAC1CH2"
#    endif
#    define DAC1CH2_TSEL_VALUE           DAC_CR_TSEL_HRT1TRG1
#  elif defined(CONFIG_STM32_DAC1CH2_HRTIM_TRG2)
#    ifndef CONFIG_STM32_HRTIM_DAC
#      error  "CONFIG_STM32_HRTIM_DAC required for DAC1CH2"
#    endif
#    define DAC1CH2_TSEL_VALUE           DAC_CR_TSEL_HRT1TRG2
#  elif CONFIG_STM32_DAC1CH2_TIMER == 6
#    ifndef CONFIG_STM32_TIM6_DAC
#      error "CONFIG_STM32_TIM6_DAC required for DAC1CH2"
#    endif
#    define DAC1CH2_TSEL_VALUE           DAC_CR_TSEL_TIM6
#    define DAC1CH2_TIMER_BASE           STM32_TIM6_BASE
#    define DAC1CH2_TIMER_PCLK_FREQUENCY STM32_PCLK1_FREQUENCY
#  elif CONFIG_STM32_DAC1CH2_TIMER == 3 && defined(CONFIG_STM32_CONNECTIVITYLINE)
#    ifndef CONFIG_STM32_TIM3_DAC
#      error "CONFIG_STM32_TIM3_DAC required for DAC1CH2"
#    endif
#    define DAC1CH2_TSEL_VALUE           DAC_CR_TSEL_TIM3
#    define DAC1CH2_TIMER_BASE           STM32_TIM3_BASE
#    define DAC1CH2_TIMER_PCLK_FREQUENCY STM32_PCLK1_FREQUENCY
#  elif CONFIG_STM32_DAC1CH2_TIMER == 8 && !defined(CONFIG_STM32_CONNECTIVITYLINE)
#    ifndef CONFIG_STM32_TIM8_DAC
#      error "CONFIG_STM32_TIM8_DAC required for DAC1CH2"
#    endif
#    define DAC1CH2_TSEL_VALUE           DAC_CR_TSEL_TIM8
#    define DAC1CH2_TIMER_BASE           STM32_TIM8_BASE
#    define DAC1CH2_TIMER_PCLK_FREQUENCY STM32_PCLK2_FREQUENCY
#  elif CONFIG_STM32_DAC1CH2_TIMER == 7
#    ifndef CONFIG_STM32_TIM7_DAC
#      error "CONFIG_STM32_TIM7_DAC required for DAC1CH2"
#    endif
#    define DAC1CH2_TSEL_VALUE           DAC_CR_TSEL_TIM7
#    define DAC1CH2_TIMER_BASE           STM32_TIM7_BASE
#    define DAC1CH2_TIMER_PCLK_FREQUENCY STM32_PCLK1_FREQUENCY
#  elif CONFIG_STM32_DAC1CH2_TIMER == 5
#    ifndef CONFIG_STM32_TIM5_DAC
#      error "CONFIG_STM32_TIM5_DAC required for DAC1CH2"
#    endif
#    define DAC1CH2_TSEL_VALUE           DAC_CR_TSEL_TIM5
#    define DAC1CH2_TIMER_BASE           STM32_TIM5_BASE
#    define DAC1CH2_TIMER_PCLK_FREQUENCY STM32_PCLK1_FREQUENCY
#  elif CONFIG_STM32_DAC1CH2_TIMER == 2
#    ifndef CONFIG_STM32_TIM2_DAC
#      error "CONFIG_STM32_TIM2_DAC required for DAC1CH2"
#    endif
#    define DAC1CH2_TSEL_VALUE           DAC_CR_TSEL_TIM2
#    define DAC1CH2_TIMER_BASE           STM32_TIM2_BASE
#    define DAC1CH2_TIMER_PCLK_FREQUENCY STM32_PCLK1_FREQUENCY
#  elif CONFIG_STM32_DAC1CH2_TIMER == 4
#    ifndef CONFIG_STM32_TIM4_DAC
#      error "CONFIG_STM32_TIM4_DAC required for DAC1CH2"
#    endif
#    define DAC1CH2_TSEL_VALUE           DAC_CR_TSEL_TIM4
#    define DAC1CH2_TIMER_BASE           STM32_TIM4_BASE
#    define DAC1CH2_TIMER_PCLK_FREQUENCY STM32_PCLK1_FREQUENCY
#  else
#    error "Unsupported CONFIG_STM32_DAC1CH2_TIMER"
#  endif
#else
#  define DAC1CH2_TSEL_VALUE DAC_CR_TSEL_SW
#endif

#ifdef CONFIG_STM32_DAC2CH1_DMA
#  if defined(CONFIG_STM32_DAC2CH1_DMA_EXTERNAL)
#  elif defined(CONFIG_STM32_DAC2CH1_HRTIM_TRG3)
#    ifndef CONFIG_STM32_HRTIM_DAC
#      error  "CONFIG_STM32_HRTIM_DAC required for DAC2CH1"
#    endif
#    define DAC2CH1_TSEL_VALUE           DAC_CR_TSEL_HRT1TRG3
#  elif CONFIG_STM32_DAC2CH1_TIMER == 6
#    ifndef CONFIG_STM32_TIM6_DAC
#      error "CONFIG_STM32_TIM6_DAC required for DAC2CH1"
#    endif
#    define DAC2CH1_TSEL_VALUE           DAC_CR_TSEL_TIM6
#    define DAC2CH1_TIMER_BASE           STM32_TIM6_BASE
#    define DAC2CH1_TIMER_PCLK_FREQUENCY STM32_PCLK1_FREQUENCY
#  elif CONFIG_STM32_DAC2CH1_TIMER == 3 && defined(CONFIG_STM32_CONNECTIVITYLINE)
#    ifndef CONFIG_STM32_TIM3_DAC
#      error "CONFIG_STM32_TIM3_DAC required for DAC2CH1"
#    endif
#    define DAC2CH1_TSEL_VALUE           DAC_CR_TSEL_TIM3
#    define DAC2CH1_TIMER_BASE           STM32_TIM3_BASE
#    define DAC2CH1_TIMER_PCLK_FREQUENCY STM32_PCLK1_FREQUENCY
#  elif CONFIG_STM32_DAC2CH1_TIMER == 8 && !defined(CONFIG_STM32_CONNECTIVITYLINE)
#    ifndef CONFIG_STM32_TIM8_DAC
#      error "CONFIG_STM32_TIM8_DAC required for DAC2CH1"
#    endif
#    define DAC2CH1_TSEL_VALUE           DAC_CR_TSEL_TIM8
#    define DAC2CH1_TIMER_BASE           STM32_TIM8_BASE
#    define DAC2CH1_TIMER_PCLK_FREQUENCY STM32_PCLK2_FREQUENCY
#  elif CONFIG_STM32_DAC2CH1_TIMER == 7
#    ifndef CONFIG_STM32_TIM7_DAC
#      error "CONFIG_STM32_TIM7_DAC required for DAC2CH1"
#    endif
#    define DAC2CH1_TSEL_VALUE           DAC_CR_TSEL_TIM7
#    define DAC2CH1_TIMER_BASE           STM32_TIM7_BASE
#    define DAC2CH1_TIMER_PCLK_FREQUENCY STM32_PCLK1_FREQUENCY
#  elif CONFIG_STM32_DAC2CH1_TIMER == 5
#    ifndef CONFIG_STM32_TIM5_DAC
#      error "CONFIG_STM32_TIM5_DAC required for DAC2CH1"
#    endif
#    define DAC2CH1_TSEL_VALUE           DAC_CR_TSEL_TIM5
#    define DAC2CH1_TIMER_BASE           STM32_TIM5_BASE
#    define DAC2CH1_TIMER_PCLK_FREQUENCY STM32_PCLK1_FREQUENCY
#  elif CONFIG_STM32_DAC2CH1_TIMER == 2
#    ifndef CONFIG_STM32_TIM2_DAC
#      error "CONFIG_STM32_TIM2_DAC required for DAC2CH1"
#    endif
#    define DAC2CH1_TSEL_VALUE           DAC_CR_TSEL_TIM2
#    define DAC2CH1_TIMER_BASE           STM32_TIM2_BASE
#    define DAC2CH1_TIMER_PCLK_FREQUENCY STM32_PCLK1_FREQUENCY
#  elif CONFIG_STM32_DAC2CH1_TIMER == 4
#    ifndef CONFIG_STM32_TIM4_DAC
#      error "CONFIG_STM32_TIM4_DAC required for DAC2CH1"
#    endif
#    define DAC2CH1_TSEL_VALUE           DAC_CR_TSEL_TIM4
#    define DAC2CH1_TIMER_BASE           STM32_TIM4_BASE
#    define DAC2CH1_TIMER_PCLK_FREQUENCY STM32_PCLK1_FREQUENCY
#  else
#    error "Unsupported CONFIG_STM32_DAC2CH1_TIMER"
#  endif
#else
#  define DAC2CH1_TSEL_VALUE DAC_CR_TSEL_SW
#endif

/* We need index which describes when HRTIM is selected as trigger.
 * It will be used to skip timer configuration where needed.
 */

#define TIM_INDEX_HRTIM 255

