apache/nuttx/arch/arm/src/common/stm32/stm32_dac_m3m4_v1.c
#if defined(DAC1CH1_HRTIM) || defined(DAC1CH2_HRTIM) || defined(DAC2CH1_HRTIM)
#  define HAVE_HRTIM
#endif

/* DMA buffers default size */

#if !defined(CONFIG_STM32_DAC1CH1_DMA_BUFFER_SIZE) && defined(CONFIG_STM32_DAC1CH1_DMA)
#  error "DAC1CH1 buffer size must be provided"
#endif
#if !defined(CONFIG_STM32_DAC1CH2_DMA_BUFFER_SIZE) && defined(CONFIG_STM32_DAC1CH2_DMA)
#  error "DAC1CH2 buffer size must be provided"
#endif
#if !defined(CONFIG_STM32_DAC2CH1_DMA_BUFFER_SIZE) && defined(CONFIG_STM32_DAC2CH1_DMA)
#  error "DAC2CH1 buffer size must be provided"
#endif

/* Calculate timer divider values based upon DACn_TIMER_PCLK_FREQUENCY and
 * CONFIG_STM32_DACn_TIMER_FREQUENCY.
 */

#warning "Missing Logic"

/* DMA stream/channel configuration.  The register layout depends on the DMA
 * IP version, not the DAC IP version: stream DMA (IPv2) uses the SCR
 * register fields, while channel DMA (IPv1) uses the CCR register fields.
 */

#if defined(CONFIG_STM32_HAVE_IP_DMA_V2)
#  define DAC_DMA_CONTROL_WORD (DMA_SCR_MSIZE_16BITS | \
                                DMA_SCR_PSIZE_16BITS | \
                                DMA_SCR_MINC | \
                                DMA_SCR_CIRC | \
                                DMA_SCR_DIR_M2P)
#else
#  define DAC_DMA_CONTROL_WORD (DMA_CCR_MSIZE_16BITS | \
                                DMA_CCR_PSIZE_16BITS | \
                                DMA_CCR_MINC | \
                                DMA_CCR_CIRC | \
                                DMA_CCR_DIR)
#endif

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* This structure represents the internal state of the single STM32 DAC
 * block
 */

struct stm32_dac_s
{
  uint8_t    init   : 1; /* True, the DAC block has been initialized */
};

/* This structure represents the internal state of one STM32 DAC channel */

struct stm32_chan_s
{
  uint8_t    inuse  : 1; /* True, the driver is in use and not available */
#ifdef HAVE_DMA
  uint8_t    hasdma : 1; /* True, this channel supports DMA */
  uint8_t    text   : 1; /* True, DMA triggering from external source */
  uint8_t    timer;      /* Timer number 2-8 */
#endif
  uint8_t    intf;       /* DAC zero-based interface number (0 or 1) */
  uint32_t   pin;        /* Pin configuration */
#ifdef HAVE_IP_DAC_V2
  uint32_t   mode;       /* DAC channel mode */
#endif
  uint32_t   dro;        /* Data output register */
  uint32_t   cr;         /* Control register */
  uint32_t   tsel;       /* CR trigger select value */
#ifdef HAVE_IP_DAC_V2
  uint32_t   sr;         /* Status register */
  uint32_t   mcr;        /* Mode Control register */
#endif
#ifdef HAVE_DMA
  uint16_t   dmachan;    /* DMA channel needed by this DAC */
  uint16_t   buffer_len; /* DMA buffer length */
  DMA_HANDLE dma;        /* Allocated DMA channel */
#  ifdef HAVE_TIMER
  uint32_t   tbase;      /* Timer base address */
  uint32_t   tfrequency; /* Timer frequency */
#  endif
  uint16_t   *dmabuffer; /* DMA transfer buffer */
#endif
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* DAC Register access */

#ifdef HAVE_TIMER
static uint32_t tim_getreg(struct stm32_chan_s *chan, int offset);
static void     tim_putreg(struct stm32_chan_s *chan, int offset,
                           uint32_t value);
static void     tim_modifyreg(struct stm32_chan_s *chan, int offset,
                              uint32_t clearbits, uint32_t setbits);
#endif

/* Interrupt handler */

#if 0 /* defined(CONFIG_STM32_HAVE_IP_DAC_M3M4_V1) */
static int  dac_interrupt(int irq, void *context, void *arg);
#endif

/* DAC methods */

static void dac_reset(struct dac_dev_s *dev);
static int  dac_setup(struct dac_dev_s *dev);
static void dac_shutdown(struct dac_dev_s *dev);
static void dac_txint(struct dac_dev_s *dev, bool enable);
static int  dac_send(struct dac_dev_s *dev, struct dac_msg_s *msg);
static int  dac_ioctl(struct dac_dev_s *dev, int cmd, unsigned long arg);

/* Initialization */

#ifdef HAVE_DMA
#  ifdef HAVE_TIMER
static int  dac_timinit(struct stm32_chan_s *chan);
#  endif
static int  dma_remap(struct stm32_chan_s *chan);
static void dma_bufferinit(struct stm32_chan_s *chan, uint16_t *buffer,
                           uint16_t len);
#endif
static int  dac_chaninit(struct stm32_chan_s *chan);
static int  dac_blockinit(void);

/****************************************************************************
 * Private Data
 ****************************************************************************/

static const struct dac_ops_s g_dacops =
{
  .ao_reset    = dac_reset,
  .ao_setup    = dac_setup,
  .ao_shutdown = dac_shutdown,
  .ao_txint    = dac_txint,
  .ao_send     = dac_send,
  .ao_ioctl    = dac_ioctl,
};

#ifdef CONFIG_STM32_DAC1
#ifdef CONFIG_STM32_DAC1CH1
/* Channel 1: DAC1 channel 1 */

#ifdef CONFIG_STM32_DAC1CH1_DMA
uint16_t   dac1ch1_buffer[CONFIG_STM32_DAC1CH1_DMA_BUFFER_SIZE];
#endif

static struct stm32_chan_s g_dac1ch1priv =
{
  .intf       = 0,
  .pin        = GPIO_DAC1_OUT1,
#ifdef HAVE_IP_DAC_V2
  .mode       = CONFIG_STM32_DAC1CH1_MODE;
#endif
  .dro        = STM32_DAC1_DHR12R1,
  .cr         = STM32_DAC1_CR,
#ifdef HAVE_IP_DAC_V2
  .sr         = STM32_DAC1_SR,
  .mcr        = STM32_DAC1_MCR,
#endif
#ifdef CONFIG_STM32_DAC1CH1_DMA
  .hasdma     = 1,
  .dmachan    = DAC1CH1_DMA_CHAN,
  .buffer_len = CONFIG_STM32_DAC1CH1_DMA_BUFFER_SIZE,
  .dmabuffer  = dac1ch1_buffer,
#  ifdef CONFIG_STM32_DAC1CH1_DMA_EXTERNAL
  .text       = 1,
#  else
  .text       = 0,
  .tsel       = DAC1CH1_TSEL_VALUE,
#    ifdef DAC1CH1_HRTIM
  .timer      = TIM_INDEX_HRTIM,
#    else
  .timer      = CONFIG_STM32_DAC1CH1_TIMER,
  .tbase      = DAC1CH1_TIMER_BASE,
  .tfrequency = CONFIG_STM32_DAC1CH1_TIMER_FREQUENCY,
#    endif
#  endif
#endif
};

static struct dac_dev_s g_dac1ch1dev =
{
  .ad_ops  = &g_dacops,
  .ad_priv = &g_dac1ch1priv,
};
#endif /* CONFIG_STM32_DAC1CH1 */

#ifdef CONFIG_STM32_DAC1CH2
/* Channel 2: DAC1 channel 2 */

#ifdef CONFIG_STM32_DAC1CH2_DMA
uint16_t   dac1ch2_buffer[CONFIG_STM32_DAC1CH2_DMA_BUFFER_SIZE];
#endif

static struct stm32_chan_s g_dac1ch2priv =
{
  .intf       = 1,
  .pin        = GPIO_DAC1_OUT2,
#ifdef HAVE_IP_DAC_V2
  .mode       = CONFIG_STM32_DAC1CH2_MODE << 16;
#endif
  .dro        = STM32_DAC1_DHR12R2,
  .cr         = STM32_DAC1_CR,
#ifdef HAVE_IP_DAC_V2
  .sr         = STM32_DAC1_SR,
  .mcr        = STM32_DAC1_MCR,
#endif
#ifdef CONFIG_STM32_DAC1CH2_DMA
  .hasdma     = 1,
  .dmachan    = DAC1CH2_DMA_CHAN,
  .buffer_len = CONFIG_STM32_DAC1CH2_DMA_BUFFER_SIZE,
  .dmabuffer  = dac1ch2_buffer,
#  ifdef CONFIG_STM32_DAC1CH2_DMA_EXTERNAL
  .text       = 1,
#  else
  .text       = 0,
  .tsel       = DAC1CH2_TSEL_VALUE,
#    ifdef DAC1CH2_HRTIM
  .timer      = TIM_INDEX_HRTIM,
#    else
  .timer      = CONFIG_STM32_DAC1CH2_TIMER,
  .tbase      = DAC1CH2_TIMER_BASE,
  .tfrequency = CONFIG_STM32_DAC1CH2_TIMER_FREQUENCY,
#    endif
#  endif
#endif
};

static struct dac_dev_s g_dac1ch2dev =
{
  .ad_ops  = &g_dacops,
  .ad_priv = &g_dac1ch2priv,
};
#endif /* CONFIG_STM32_DAC1CH2 */

#endif /* CONFIG_STM32_DAC1 */

#ifdef CONFIG_STM32_DAC2
#ifdef CONFIG_STM32_DAC2CH1
/* Channel 3: DAC2 channel 1 */

#ifdef CONFIG_STM32_DAC2CH1_DMA
uint16_t   dac2ch1_buffer[CONFIG_STM32_DAC2CH1_DMA_BUFFER_SIZE];
#endif

