apache/nuttx/arch/arm/src/common/stm32/stm32_dac_m3m4_v1.c
static struct stm32_chan_s g_dac2ch1priv =
{
  .intf       = 2,
  .pin        = GPIO_DAC2_OUT1,
#ifdef HAVE_IP_DAC_V2
  .mode       = CONFIG_STM32_DAC2CH1_MODE;
#endif
  .dro        = STM32_DAC2_DHR12R1,
  .cr         = STM32_DAC2_CR,
#ifdef HAVE_IP_DAC_V2
  .sr         = STM32_DAC2_SR,
  .mcr        = STM32_DAC2_MCR,
#endif
#ifdef CONFIG_STM32_DAC2CH1_DMA
  .hasdma     = 1,
  .dmachan    = DAC2CH1_DMA_CHAN,
  .buffer_len = CONFIG_STM32_DAC2CH1_DMA_BUFFER_SIZE,
  .dmabuffer  = dac2ch1_buffer,
#  ifdef CONFIG_STM32_DAC2CH1_DMA_EXTERNAL
  .text       = 1,
#  else
  .text       = 0,
  .tsel       = DAC2CH1_TSEL_VALUE,
#    ifdef DAC2CH1_HRTIM
  .timer      = TIM_INDEX_HRTIM,
#    else
  .timer      = CONFIG_STM32_DAC2CH1_TIMER,
  .tbase      = DAC2CH1_TIMER_BASE,
  .tfrequency = CONFIG_STM32_DAC2CH1_TIMER_FREQUENCY,
#    endif
#  endif
#endif
};

static struct dac_dev_s g_dac2ch1dev =
{
  .ad_ops  = &g_dacops,
  .ad_priv = &g_dac2ch1priv,
};
#endif /* CONFIG_STM32_DAC2CH1 */
#endif /* CONFIG_STM32_DAC2 */

#ifdef CONFIG_STM32_DAC3
#ifdef CONFIG_STM32_DAC3CH1
/* Channel 4: DAC3 channel 1 */

#ifdef CONFIG_STM32_DAC3CH1_DMA
#  error "STM32_DAC3 DMA not supported"
#endif

static struct stm32_chan_s g_dac3ch1priv =
{
  .intf       = 4,
  .dro        = STM32_DAC3_DHR12R1,
#ifdef HAVE_IP_DAC_V2
  .mode       = CONFIG_STM32_DAC3CH1_MODE;
#endif
  .cr         = STM32_DAC3_CR,
#ifdef HAVE_IP_DAC_V2
  .sr         = STM32_DAC3_SR,
  .mcr        = STM32_DAC3_MCR,
#endif
};

static struct dac_dev_s g_dac3ch1dev =
{
  .ad_ops  = &g_dacops,
  .ad_priv = &g_dac3ch1priv,
};
#endif /* CONFIG_STM32_DAC3CH1 */

#ifdef CONFIG_STM32_DAC3CH2
/* Channel 5: DAC3 channel 1 */

#ifdef CONFIG_STM32_DAC3CH2_DMA
#  error "STM32_DAC3 DMA not supported"
#endif

static struct stm32_chan_s g_dac3ch2priv =
{
  .intf       = 5,
  .dro        = STM32_DAC3_DHR12R2,
#ifdef HAVE_IP_DAC_V2
  .mode       = CONFIG_STM32_DAC3CH2_MODE << 16,
#endif
  .cr         = STM32_DAC3_CR,
#ifdef HAVE_IP_DAC_V2
  .sr         = STM32_DAC3_SR,
  .mcr        = STM32_DAC3_MCR,
#endif
};

static struct dac_dev_s g_dac3ch2dev =
{
  .ad_ops  = &g_dacops,
  .ad_priv = &g_dac3ch2priv,
};
#endif /* CONFIG_STM32_DAC3CH2 */
#endif /* CONFIG_STM32_DAC3 */

static struct stm32_dac_s g_dacblock;

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: stm32_dac_modify_cr
 *
 * Description:
 *   Modify the contents of the DAC control register.
 *
 * Input Parameters:
 *   priv - Driver state instance
 *   clearbits - Bits in the control register to be cleared
 *   setbits - Bits in the control register to be set
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static inline void stm32_dac_modify_cr(struct stm32_chan_s *chan,
                                       uint32_t clearbits, uint32_t setbits)
{
  unsigned int shift;

  /* DAC1 channels 1 and 2 share the STM32_DAC[1]_CR control register.  DAC2
   * channel 1 (and perhaps channel 2) uses the STM32_DAC2_CR control
   * register.  In either case, bit 0 of the interface number provides the
   * correct shift.
   *
   *   Bit 0 = 0: Shift = 0
   *   Bit 0 = 1: Shift = 16
   */

  shift = (chan->intf & 1) << 4;
  modifyreg32(chan->cr, clearbits << shift, setbits << shift);
}

#ifdef HAVE_TIMER

/****************************************************************************
 * Name: tim_getreg
 *
 * Description:
 *   Read the value of an DMA timer register.
 *
 * Input Parameters:
 *   chan - A reference to the DAC block status
 *   offset - The offset to the register to read
 *
 * Returned Value:
 *   The current contents of the specified register
 *
 ****************************************************************************/

static uint32_t tim_getreg(struct stm32_chan_s *chan, int offset)
{
  return getreg32(chan->tbase + offset);
}

/****************************************************************************
 * Name: tim_putreg
 *
 * Description:
 *   Read the value of an DMA timer register.
 *
 * Input Parameters:
 *   chan - A reference to the DAC block status
 *   offset - The offset to the register to read
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void tim_putreg(struct stm32_chan_s *chan, int offset,
                       uint32_t value)
{
  putreg32(value, chan->tbase + offset);
}

/****************************************************************************
 * Name: tim_modifyreg
 *
 * Description:
 *   Modify the value of an DMA timer register.
 *
 * Input Parameters:
 *   priv - Driver state instance
 *   offset - The timer register offset
 *   clearbits - Bits in the control register to be cleared
 *   setbits - Bits in the control register to be set
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void tim_modifyreg(struct stm32_chan_s *chan, int offset,
                          uint32_t clearbits, uint32_t setbits)
{
  modifyreg32(chan->tbase + offset, clearbits, setbits);
}
#endif /* HAVE_TIMER */

/****************************************************************************
 * Name: dac_interrupt
 *
 * Description:
 *   DAC interrupt handler.  The STM32 F4 family supports a only a DAC
 *   underrun interrupt.
 *
 * Input Parameters:
 *
 * Returned Value:
 *   OK
 *
 ****************************************************************************/

#if 0 /* defined(CONFIG_STM32_HAVE_IP_DAC_M3M4_V1) */
static int dac_interrupt(int irq, void *context, void *arg)
{
#warning "Missing logic"
  return OK;
}
#endif

/****************************************************************************
 * Name: dac_reset
 *
 * Description:
 *   Reset the DAC channel.  Called early to initialize the hardware. This
 *   is called, before dac_setup() and on error conditions.
 *
 *   NOTE:  DAC reset will reset both DAC channels!
 *
 * Input Parameters:
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void dac_reset(struct dac_dev_s *dev)
{
  irqstate_t flags;

  /* Reset only the selected DAC channel; the other DAC channel must remain
   * functional.
   */

