apache/nuttx/arch/arm/src/common/stm32/stm32_dac_m3m4_v1.c
  switch (chan->intf)
    {
      case 0:
        {
          /* Remap DMA1CH3 to DAC1CH1 */

          regval |= SYSCFG_CFGR1_DAC1CH1_DMARMP;

         /* Remap DAC trigger for STM32F33XX if needed */

#  ifdef CONFIG_STM32_STM32F33XX
#    if defined(CONFIG_STM32_DAC1CH1_HRTIM_TRG1)
          modifyreg32(STM32_SYSCFG_CFGR3, 0, SYSCFG_CFGR3_DAC1_TRIG3_RMP);
#    elif defined(CONFIG_STM32_DAC1CH1_HRTIM_TRG2)
          modifyreg32(STM32_SYSCFG_CFGR3, 0, SYSCFG_CFGR3_DAC1_TRIG5_RMP);
#    endif
#  endif
          break;
        }

      case 1:
        {
          /* Remap DMA1CH4 to DAC1CH2 */

          regval |= SYSCFG_CFGR1_DAC1CH2_DMARMP;

          /* Remap DAC trigger for STM32F33XX if needed */

#  ifdef CONFIG_STM32_STM32F33XX
#    if defined(CONFIG_STM32_DAC1CH2_HRTIM_TRG1)
          modifyreg32(STM32_SYSCFG_CFGR3, 0, SYSCFG_CFGR3_DAC1_TRIG3_RMP);
#    elif defined(CONFIG_STM32_DAC1CH2_HRTIM_TRG2)
          modifyreg32(STM32_SYSCFG_CFGR3, 0, SYSCFG_CFGR3_DAC1_TRIG5_RMP);
#    endif
#  endif
          break;
        }

      case 2:
        {
          /* Remap DMA1CH5 to DAC2CH1 */

          regval |= SYSCFG_CFGR1_DAC2CH1_DMARMP;
          break;
        }

      default:
        {
          return -EINVAL;
        }
    }

  modifyreg32(STM32_SYSCFG_BASE, 0, regval);

#endif

  return OK;
}

/****************************************************************************
 * Name: dac_timinit
 *
 * Description:
 *   Initialize the timer that drivers the DAC DMA for this channel using
 *   the pre-calculated timer divider definitions.
 *
 * Input Parameters:
 *   chan - A reference to the DAC channel state data
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure.
 *
 ****************************************************************************/

#ifdef HAVE_TIMER
static int dac_timinit(struct stm32_chan_s *chan)
{
  uint32_t pclk;
  uint32_t prescaler;
  uint32_t timclk;
  uint32_t reload;
  uint32_t regaddr;
  uint32_t setbits;

  /* Configure the time base: Timer period, prescaler, clock division,
   * counter mode (up).
   */

  /* Enable the timer.  At most, two of the following cases (pulse the
   * default) will be enabled
   */

  regaddr = STM32_RCC_APB1ENR;

  switch (chan->timer)
    {
#ifdef NEED_TIM2
      case 2:
        setbits = RCC_APB1ENR_TIM2EN;
        pclk    = STM32_TIM2_CLKIN;
        break;
#endif
#ifdef NEED_TIM3
      case 3:
        setbits = RCC_APB1ENR_TIM3EN;
        pclk    = STM32_TIM3_CLKIN;
        break;
#endif
#ifdef NEED_TIM4
      case 4:
        setbits = RCC_APB1ENR_TIM4EN;
        pclk    = STM32_TIM4_CLKIN;
        break;
#endif
#ifdef NEED_TIM5
      case 5:
        setbits = RCC_APB1ENR_TIM5EN;
        pclk    = STM32_TIM5_CLKIN;
        break;
#endif
#ifdef NEED_TIM6
      case 6:
        setbits = RCC_APB1ENR_TIM6EN;
        pclk    = STM32_TIM6_CLKIN;
        break;
#endif
#ifdef NEED_TIM7
      case 7:
        setbits = RCC_APB1ENR_TIM7EN;
        pclk    = STM32_TIM7_CLKIN;
        break;
#endif
#ifdef NEED_TIM8
      case 8:
        regaddr = STM32_RCC_APB2ENR;
        setbits = RCC_APB2ENR_TIM8EN;
        pclk    = STM32_TIM8_CLKIN;
        break;
#endif
      default:
        aerr("ERROR: Could not enable timer\n");
        return -EINVAL;
    }

  /* Enable the timer. */

  modifyreg32(regaddr, 0, setbits);

  /* Calculate optimal values for the timer prescaler and for the timer
   * reload register.  If 'frequency' is the desired frequency, then
   *
   *   reload = timclk / frequency
   *   timclk = pclk / presc
   *
   * Or,
   *
   *   reload = pclk / presc / frequency
   *
   * There are many solutions to this, but the best solution will be the one
   * that has the largest reload value and the smallest prescaler value.
   * That is the solution that should give us the most accuracy in the timer
   * control.  Subject to:
   *
   *   0 <= presc  <= 65536
   *   1 <= reload <= 65535
   *
   * So presc = pclk / 65535 / frequency would be optimal.
   *
   * Example:
   *
   *  pclk      = 42 MHz
   *  frequency = 100 Hz
   *
   *  prescaler = 42,000,000 / 65,535 / 100
   *            = 6.4 (or 7 -- taking the ceiling always)
   *  timclk    = 42,000,000 / 7
   *            = 6,000,000
   *  reload    = 6,000,000 / 100
   *            = 60,000
   */

  prescaler = (pclk / chan->tfrequency + 65534) / 65535;
  if (prescaler < 1)
    {
      prescaler = 1;
    }
  else if (prescaler > 65536)
    {
      prescaler = 65536;
    }

  timclk = pclk / prescaler;

  reload = timclk / chan->tfrequency;
  if (reload < 1)
    {
      reload = 1;
    }
  else if (reload > 65535)
    {
      reload = 65535;
    }

  /* Set the reload and prescaler values */

  tim_putreg(chan, STM32_GTIM_ARR_OFFSET, (uint16_t)reload);
  tim_putreg(chan, STM32_GTIM_PSC_OFFSET, (uint16_t)(prescaler - 1));

  /* Count mode up, auto reload */

  tim_modifyreg(chan, STM32_GTIM_CR1_OFFSET, 0, GTIM_CR1_ARPE);

  /* Selection TRGO selection: update */

  tim_modifyreg(chan, STM32_GTIM_CR2_OFFSET, GTIM_CR2_MMS_MASK,
                GTIM_CR2_MMS_UPDATE);

  /* Update DMA request enable ???? */
#if 0
  tim_modifyreg(chan, STM32_GTIM_DIER_OFFSET, 0, GTIM_DIER_UDE);
#endif

  /* Enable the counter */

  tim_modifyreg(chan, STM32_GTIM_CR1_OFFSET, 0, GTIM_CR1_CEN);
  return OK;
}
#endif
#endif /* HAVE_DMA */

/****************************************************************************
 * Name: dac_chaninit
 *
 * Description:
 *   Initialize the DAC channel.
 *
 * Input Parameters:
 *   chan - A reference to the DAC channel state data
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure.
 *
 ****************************************************************************/

static int dac_chaninit(struct stm32_chan_s *chan)
{
  uint16_t clearbits;
  uint16_t setbits;
#if defined(HAVE_IP_DAC_V2)
  uint32_t regval;
#endif
#ifdef HAVE_TIMER
  int ret;
#endif

  /* Is the selected channel already in-use? */

  if (chan->inuse)
    {
      /* Yes.. then return EBUSY */

      return -EBUSY;
    }

  /* Configure the DAC output pin:
   *
   * DAC -" Once the DAC channelx is enabled, the corresponding GPIO pin
   * (PA4 or PA5) is automatically connected to the analog converter output
   * (DAC_OUTx). In order to avoid parasitic consumption, the PA4 or PA5 pin
   * should first be configured to analog (AIN)".
   */

  /* Only DAC1 and DAC2 have external pins */

  if (chan->intf < 4)
    {
      stm32_configgpio(chan->pin);
    }

  /* DAC channel configuration:
   *
   * - Set the trigger selection based upon the configuration.
   * - Set wave generation == None.
   * - Enable the output buffer.
   */

  /* Disable before change */

  stm32_dac_modify_cr(chan, DAC_CR_EN, 0);

  clearbits = DAC_CR_TSEL_MASK |
              DAC_CR_MAMP_MASK |
              DAC_CR_WAVE_MASK;
#if defined (HAVE_IP_DAC_V1)
  clearbits |= DAC_CR_BOFF;
#endif

  setbits =
      chan->tsel |           /* Set trigger source (SW or timer TRGO event) */
      DAC_CR_MAMP_AMP1 |     /* Set waveform characteristics */
      DAC_CR_WAVE_DISABLED;  /* Set wave generation disabled */
#if defined (HAVE_IP_DAC_V1)
  setbits |= DAC_CR_BOFF_EN; /* Enable output buffer */
#endif

  stm32_dac_modify_cr(chan, clearbits, setbits);

#if defined(HAVE_IP_DAC_V2)
  /* High frequency interface mode selection */

  if (STM32_SYSCLK_FREQUENCY > 160000000)
    {
      regval = DAC_MCR_HFSEL_AHB_160MHz;
    }
  else if (STM32_SYSCLK_FREQUENCY > 80000000)
    {
      regval = DAC_MCR_HFSEL_AHB_80MHz;
    }
  else
    {
      regval = DAC_MCR_HFSEL_DISABLED;
    }

